app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.save
---
INSERT INTO "posts" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Hello There, This Is A New Blog Post"], ["created_at", "2019-11-27 21:43:54.233406"], ["updated_at", "2019-11-27 21:43:54.233406"]]